{"chunk_id":"2025_07_19_pyramid_rules::root::0001::90f2d2f772","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"Pyramid General Rules 1. Table, balls, equipment When playing pyramid games described in this rules tables, balls and equipment meeting standards prescribed in the «IPC Equipment Specifications» should be used. 2. Marking the Pyramid Table 2.1. The following accurate and clearly visible lines and spots must be marked on the cloth of the Pyramid Table: (1) Center spot – a point in the center of the playing surface of the table. (2) Center line – a straight line drawn through the center spot parallel to the short rails. The center line divides the playing surface of the table on two halves – a head half and a foot half. (3) Head spot – a point in the center of the head half of the playing surface of the table. (4) Home-line – a straight line drawn through the head spot and parallel to the head rail. (5) Foot spot – a point in the center of the foot half of the playing surface of the table. (6) Spotting line – a part of the long string drawn from the foot spot to the middle of the foot cushion. 2.2. Home is defined as the part of the bed of the table between the home-line and the head cushion. 3. Balls used Standard set of sixteen pyramid balls: fifteen ivory white balls numbered 1-15 plus one colored (preferably yellow) unnumbered ball."}
{"chunk_id":"2025_07_19_pyramid_rules::root::0002::19bcbfb668","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"table between the home-line and the head cushion. 3. Balls used Standard set of sixteen pyramid balls: fifteen ivory white balls numbered 1-15 plus one colored (preferably yellow) unnumbered ball.\n\n4. Cue ball and object balls 4.1. Cue ball is a ball struck by the cue while playing a game. 4.2. While playing games other than “Free pyramid” the colored ball is used as the cue ball. a 4.3. While playing “Free pyramid” any ball on the bed of the table (regardless of its color) may be used as the cue ball by a shooter, when it is his/her turn to perform a stroke. (The only exception is an opening break shot when a colored ball should be used as the cue ball.) 4.4. Reciprocally all the other balls on the bed of the table except the cue ball are the object balls. 5. Collision 5.1. A collision (a contact) of the cue ball with one of the object balls is the necessary requirement for any shot including an opening break to be legal. 5.2. The cue ball may hit an object ball directly as well as off any cushion. 5.3. It is a foul when the cue ball fails to make contact with any object ball. 6. Playing after foul In case of a foul (after the illegally pocketed balls and the balls jumped off the table are spotted, and a penalty ball is taken off the bed of the table) an opponent has an option: (1) to perform the next stroke himself, or (2) to assign it to the offender. 7. Lag for Break 7.1. The following procedure is used for the lag for the opening break. With the balls in hand behind the home-line, one player to the left and one player to the right of the long string, the balls are shot simultaneously to the foot cushion and back to the head end of the table. The player whose ball is the closest to the head cushion wins the lag. 7.2. It is an automatic loss of the lag if: (1) The ball crosses into the opponent’s half of the table; (2) The ball fails to contact the foot cushion; (3) The ball drops into a pocket; (4) The ball jumps off the table;"}
{"chunk_id":"2025_07_19_pyramid_rules::root::0003::f984cfb60a","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"loss of the lag if: (1) The ball crosses into the opponent’s half of the table; (2) The ball fails to contact the foot cushion; (3) The ball drops into a pocket; (4) The ball jumps off the table;\n\n(5) The ball touches the long cushion; or; (6) The ball contacts the foot rail more than once. 7.3. If both players violate automatic-loss lag rules, or if the referee is unable to determine which ball is closer, the lag is a tie and is replayed. 7.4. The player winning the lag has the choice of: (1) performing the break shot or (2) assigning it to the opponent. 8. Racking the balls 8.1. Before the opening break fifteen ivory white numbered balls are racked in the form of the equilateral triangle (pyramid) with the apex ball on the foot spot and the base parallel to the foot rail. All the balls must be pressed together so that they all have contact with each other. When racking the balls a standard triangle must be used. 8.2. The colored unnumbered ball used as the cue ball on the opening break must be placed in the home area. Note: Under certain circumstances during a game an incomplete pyramid should be racked (see Rule 12 and 27). While racking the incomplete pyramid all the requirements for racking a complete pyramid should be met plus the following specific features: The incomplete pyramid is filled from the top to the bottom. The bottom raw is filled symmetrically from the middle to the edges. to the long string of the table. For perfect symmetry a ball from a top of the pyramid is replaced to the bottom raw if needed. 9. Position of ball The position of a ball is judged by the position of its center 10. Home and home-line 10.1. A home area does not include the home-line. 10.2. A ball that is dead center on the home-line is judged to be outside home. 11. Cue ball on opening break 11.1. The opening break shot is taken with cue ball in hand from home (from behind the home-line). 11.2. The colored unnumbered ball must be used as the cue ball at the opening break shot."}
{"chunk_id":"2025_07_19_pyramid_rules::root::0004::ce367727a8","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"break 11.1. The opening break shot is taken with cue ball in hand from home (from behind the home-line). 11.2. The colored unnumbered ball must be used as the cue ball at the opening break shot.\n\n11.3. The incoming player may place the cue ball anywhere in the home, but not on the home-line (see Rules 9 and 10). If the cue ball is placed outside the home, the referee or the opposing player must inform the shooting player of improper positioning of the cue ball before the shot is made. Otherwise the shot is considered legal. If the shooting player is informed of improper positioning, he must then reposition the cue ball. 11.4. The cue ball is considered to be in play once the cue ball has been struck by the cue tip (see Rule 14). 11.5. As long as the cue ball remains in hand (not in play), it may be adjusted by the player’s hand, cue, etc. Once the cue ball is in play per the above, it may not be impeded in any way by the player; to do so is to commit a foul. 12. Legal opening break shot 12.1. The opening break shot is considered to be legal, if after a collision (a contact) of the cue ball with one of the object balls: (1) any ball (the cue ball or any object ball) is legally pocketed; or (2) at least three different object (numbered) balls are driven to the cushion (cushions); or. (3) two different object (numbered) balls are driven to the cushion (cushions) and plus at least one (any one) object ball should cross the center line of the table. Failure to meet these requirements is a foul. 12.2. When the breaker fails to make a legal break, the incoming player has the option of (1) accepting the table in position and shooting, or (2) accepting the table in position and assigning the offending player to shoot, or (3) having the balls reracked and shooting the opening break (4) having the balls reracked and assigning the offending player to rebreak. Note: When reracking the balls after taking a penalty ball from the bed of the table a rule of racking an incomplete pyramid should be followed (see Rule 8). 13. Alternate break"}
{"chunk_id":"2025_07_19_pyramid_rules::root::0005::7927ab334a","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"player to rebreak. Note: When reracking the balls after taking a penalty ball from the bed of the table a rule of racking an incomplete pyramid should be followed (see Rule 8). 13. Alternate break\n\nIn every next game of the match opponents alternate break. 14. Beginning and completion of shot 14.1. The shot begins once the cue tip contacts the cue ball and completes once all the balls on the bed of the table become motionless. (A spinning ball is in motion.) 14.2. It is a foul to begin the next shot while the previous shot is not completed. 15. Striking cue ball Legal shot requires that the cue ball be struck only with the cue tip along the axes of the cue. Failure to meet this requirement is a foul. 16. Foot on floor Player must have at least one foot in contact with the floor at the moment the cue tip contacts the cue ball, or the shot is a foul. 17. Illegal touching balls It is a foul to make contact with any ball (the cue ball or any object ball) on the bed of the table with anything (the body, clothing, chalk, mechanical bridge, cue shaft, etc.) except the cue tip (while attached to the cue shaft), which may contact the cue ball in the execution of a shot. 18. Fouls by double hit If the cue stick touches the cue ball more than once on a shot, the shot is a foul. 19. Push stroke fouls 19.1. When striking the cue ball it is prohibited to maintain a contact between the cue tip and the cue ball till the moment the cue ball strikes (makes contact with) the object ball. Otherwise the stroke is considered a push stroke and it is a foul. 19.2. If the cue ball is touching the required object ball prior to the shot, or if the distance between the cue ball and the object ball is so negligibly little that it is practically impossible to avoid a momentary triple contact – “cue tip-cue ball-object ball” , it shall not be considered a push stroke if a stroke is executed: (1) no less than 45 degrees away from the center line of these two balls, or (2) In such a way that cue ball does not follow through the object ball. Otherwise it is a foul."}
{"chunk_id":"2025_07_19_pyramid_rules::root::0006::a1c64b6f13","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"if a stroke is executed: (1) no less than 45 degrees away from the center line of these two balls, or (2) In such a way that cue ball does not follow through the object ball. Otherwise it is a foul.\n\nNote: Playing away from a frozen object ball (without moving the latter) does not constitute a collision with this object ball. If thereafter the cue ball fails to contact any object ball, the shot is a foul (see Rule 5.3). 20. Legally completed shot Any shot (except the opening break) is considered to be legal (legally completed) if none of this Rules is infringed and additionally – after a collision (a contact) of the cue ball with one of the object balls any ball on the bed of the table (the cue ball or any object ball) (1) is pocketed; or (2) rebounds off any cushion and thereafter: (a) touches another cushion, or (b) drives any ball to another cushion, or (c) touches any ball frozen to another cushion; or (3) crosses the center line and thereafter: (a) touches any cushion, or (b) drives any ball to any cushion; or (4) rebounds off any cushion and thereafter: (a) crosses the center line, or (b) drives any ball to any across the center line Failure to meet these requirements is a foul. Notes: 1. All the elementary playing acts (collisions of the balls, rebounds off the cushions, crossings the center line, etc.) must occur only in the above-mentioned order. Otherwise it is a foul. 2. If the cue ball strikes the object ball that is frozen to the cushion, and this object ball rebounds off the cushion, strikes the cue ball in return and drives it to any cushion or across the center line, the shot is considered to be legal only if there were two separate collisions – cue ball/object ball and object ball/cue ball. Otherwise it is a foul. 3. A ball crosses the center line only if the center of the ball crosses the center line. 4. If a ball rebounds off a jaw («a nose») of a side pocket and returns back to its half of the table, its center have crossed the center line at least once. 21. Cue ball in hand from behind home-line 21.1. According to the rules of some pyramid games (except “Free pyramid”) a shot may be taken with cue ball in hand from behind home-line. In this case all the requirements of Rule 11 should be met 21.2. It is allowed to pocket any ball after the cue ball contacts any object ball outside the home area . Any ball may be hit into the pocket after the cue has struck any out-of-house aiming ball. If all the aiming balls"}
{"chunk_id":"2025_07_19_pyramid_rules::root::0007::6555acc0c7","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"pocket any ball after the cue ball contacts any object ball outside the home area . Any ball may be hit into the pocket after the cue has struck any out-of-house aiming ball. If all the aiming balls\n\nare behind home-line, the shot is struck from the opposite side of the table, which in this case serves as a temporary house bounded by the back line. 21.3. A shot with cue ball in hand from behind home-line should meet all the all the requirements of Rule 20. 22. Legally and illegally pocketed balls 22.1. A ball is considered legally pocketed if as a result of a legal stroke, it drops off the bed of the table into the pocket and remains there. 22.2. All the legally pocketed balls are taken out of pockets placed onto the shelf for pocketed balls. (Each player is provided with his/her own shelf.) 22.3. If any of these Rules is infringed on the stroke all the balls dropped into the pockets as a result of this stroke are considered illegally pocketed. 22.4. All the illegally pocketed balls don’t count and are to be spotted. 22.5. A ball that rebounds from a pocket back onto the table bed is not a pocketed ball. (No penalty is to be imposed.) 23. Ball on the edge of pocket 23.1. If a ball hanging on the edge of pocket falls into a pocket without being hit by another ball, and no being a part of any stroke in progress, it shall be replaced as closely as possible to its original position prior to falling, and play shall continue. 23.2. If an object ball drops into a pocket without being hit by another ball as a player shoots at it, all the balls are to be replaced to their positions prior to the stroke, and the player shoots again. 23.3. If a ball balances momentarily on the edge of a pocket and then falls in, it shall count and not be replaced. 24. Ball jumped off the table 24.1. Balls coming to rest other than on the bed of the table after a stroke (on the cushion top, rail surface, floor, etc.) are considered jumped balls. 24.2. A ball may bounce on the cushion tops and rails of the table without being a jumped ball if it returns to the bed of the table by itself and without touching anything that is not a permanent part of the pyramid table. Balls that strike or touch anything not a part of the table, such as light fixture, chalk on the rails and cushion tops, etc., shall be considered"}
{"chunk_id":"2025_07_19_pyramid_rules::root::0008::4c2439d21c","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"that is not a permanent part of the pyramid table. Balls that strike or touch anything not a part of the table, such as light fixture, chalk on the rails and cushion tops, etc., shall be considered\n\njumped balls even though they might return to the bed of the table after contacting items which are not parts of the table. 24.3. When a stroke results in the cue ball or any object ball being a jumped ball off the table, the stroke is a foul. 24.4. All jumped balls are spotted after completion of the shot. 25. Spotting balls 25.1. All the illegally pocketed, jumped off and penalty balls are spotted after the completion of the previous shot and before the beginning of the next. 25.2. A single ball is placed on the foot spot. If more than one ball is to be spotted, they are placed in an arbitrary order on the spotting line from the foot spot to the foot cushion frozen to each other. When any balls on or near the spotting line interfere with the spotting of balls, the balls to be spotted are placed on the spotting line as close as possible to the foot spot and as close as possible to the interfering balls without being frozen to them. If there is no sufficient room on the spotting line between the foot spot and the foot cushion for balls that must be spotted, such balls are then placed on the extension of the spotting line (between the foot spot and center spot), as near as possible to the foot spot. 25.3. While playing “Free pyramid” any spotted ball can be used by the incoming player as the cue ball or as the object ball. 26. Slow play If in the opinion of the referee a player is impeding the progress of the tournament or game with consistently slow play, the referee can warn the player and then at his discretion impose a time limit up to the maximum of 45 seconds that applies to both players between shots (that is both players are put on a shot-clock). If the referee does impose a time limit and that limit is exceeded by a player who has received a 10 second «time» warning a foul will be called. 27. Non-player interference If during the match the balls are moved by a non-player (directly or by an influence on the shooter), the balls shall be replaced as near as possible to their original positions immediately prior to the incident, and play shall resume with no penalty on the player imposed. This rule also applies to «act of God» interference such as earthquakes, hurricanes, light fixture falling, power failures, etc."}
{"chunk_id":"2025_07_19_pyramid_rules::root::0009::639d4d178f","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"incident, and play shall resume with no penalty on the player imposed. This rule also applies to «act of God» interference such as earthquakes, hurricanes, light fixture falling, power failures, etc.\n\nIf the ball cannot be restored to their original positions, the colored ball is placed in the home area (if the colored ball is out of play, it should be return in play instead of any white ball remaining on the bed of the table), all the white balls remaining on the bed of the table are racked in the form of pyramid (or incomplete pyramid) with the apex on the foot spot and the game will continue with the requirements of the normal opening break (players lag for break). Scoring of points is to be resumed at the score at the moment of game disruption. Note: An incomplete pyramid should be racked according to Rule 8. 28. Non-shooting player interference If the non-shooting player distracts his opponent or interferes with his play, he has fouled. If a player shoots out of turn, or moves (or touches) any ball except during his inning, it is considered to be interference. 29. Penalties 29.1. The penalties are imposed in case of: (1) the cue ball fails to make contact with any object ball on the stroke (see Rule 5.3); (2) illegal opening break shot (see Rule 12.1); (3) the next shot begins while the previous shot is not completed (see Rule 14.2); (4) Illegal striking the cue ball (see Rule 15); (5) the player fails to have at least one foot in contact with the floor at the moment the cue tip contacts the cue ball (see Rule 16); (6) Illegal touching balls (see Rule 17); (7) the double hit (see Rule 18); (8) the push stroke (see Rules 19.1 and 19.2); (9) the illegally completed) shot (see Rule 20); (10) the cue ball or any object ball being a jumped ball off the table (see Rule 24.3); (11) Infringing the provisions of the «Slow play» Rule (see Rule 26); (12) the non-shooting player interference (see Rule 28). 29.2. If the player infringes several Rules on the single stroke, the single penalty is imposed."}
{"chunk_id":"2025_07_19_pyramid_rules::root::0010::3ea3d63df4","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"of the «Slow play» Rule (see Rule 26); (12) the non-shooting player interference (see Rule 28). 29.2. If the player infringes several Rules on the single stroke, the single penalty is imposed.\n\nFree Pyramid (also called Dynamic Pyramid) Playing “Free Pyramid” you should follow “Pyramid General Rules” and the following rules: 1. Object of the game. To score eight points prior to the opponent. 2. Balls used. Standard set of sixteen pyramid balls: fifteen ivory white balls numbered 1-15 plus one colored (preferably yellow) unnumbered ball. In the game of «Free pyramid» there is no permanent dividing the balls into the one and only cue ball (struck by the cue) and the object balls (struck by the cue ball) When performing any stroke (except the opening break) a player can use any ball on the bed of the table (regardless of its number and color) as a cue ball. Reciprocally all the other balls on the bed of the table (regardless of their number and color) can be treated as object balls. 3. Racking the balls. (see “Pyramid General Rules” p. 8.1 and p. 8.2) 4. Opening break shot. The opening break shot is performed with cue ball in hand from home (from behind the home-line) according to “Pyramid General Rules” p. 11 and p. 12. 5. Rules of the Game 5.1. Before any stroke (except the opening break) a player is entitled with a free choice of the cue ball. 5.2. If any ball is pocketed on a legal stroke, the shooter continues to play thus receiving a new free choice of the cue ball. 5.3. If no ball is pocketed on a legal stroke, a turn to perform the next stroke with a new free choice of a cue ball goes to the opponent. 5.4. It is allowed to pocket any object ball as well as to pocket a cue ball off any object ball. 5.5. There is no need to call the ball or the pocket. Any additionally pocketed ball (balls) on a legal stroke is counted in the shooter’s favor. 5.6. Any shot should be legally completed according to according to “Pyramid General Rules” p. 20. Otherwise it is a foul. 6. Scoring. Any legally pocketed ball counts one point for the shooter. In case of a foul one point is added to the opponent’s score."}
{"chunk_id":"2025_07_19_pyramid_rules::root::0011::3ccbd02e34","doc_id":"2025_07_19_pyramid_rules","source":"typed_pdf","title":"2025.07.19-Pyramid-Rules","section":null,"url":null,"topic":"misc","skill_level":"beginner","text":"to “Pyramid General Rules” p. 20. Otherwise it is a foul. 6. Scoring. Any legally pocketed ball counts one point for the shooter. In case of a foul one point is added to the opponent’s score.\n\n7. Penalties. In case of a foul (along with one point added to the opponent’s score) any ball (according to the opponent choice) is taken from the bed of the table and placed onto an opponent’s shelf for pocketed balls. Such a ball is called the penalty ball. It is taken from the bed of the table after all the illegally pocketed balls and all the balls jumped off the table are spotted. 8. Spotting balls. All the illegally pocketed balls and all the balls jumped off the table are spotted according to according to “Pyramid General Rules” p. 25."}
